      * 
      * Purpose: To perform the great programming ritual of Hello World. 
      *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello-world.
       AUTHOR. Andrew-Woods.
       DATE-WRITTEN. 2025-07-22.
       PROCEDURE DIVISION.
           DISPLAY "Hello World!".
           STOP RUN.
